;*************************************************
;* 【RA搜索框自定义功能（不用自启）】
;*************************************************
;tong
;【重要】：事先声明没有AHK基础不建议自行修改本文件，如出现错误无法解决，请关闭RA后删除本文件，将会自动初始化本文件
;【说明】：如果改动了本文件，请自行备份，避免丢失，重新下载RunAny_SearchBar.ahk不会覆盖本文件
;【建议】：自定义的变量和辅助函数加上建议使用 SearchCustom_ 前缀避免重名冲突
;【添加自定义搜索功能步骤】：【百度一下】为参考案例
	;1.【Radio_names】添加对应功能名称
	;2.【RA_suffix】、【RA_menu】与步骤1中【后缀菜单】、【菜单项】位置对应，请务必一一对应
	;3.【单选框对应功能】中按序号添加与【Radio_names】对应的功能

;------------------------------------------【自定义变量】-----------------------------------------
Label_Custom_Fun:
	global Radio_names := ["后缀菜单","菜单项","百度一下"]
	global RA_suffix := 1		;后缀菜单对应位置
	global RA_menu := 2			;菜单项对应位置
	global Radio_Default := 2	;默认搜索对应位置，默认为菜单项
Return

;----------------------------------------【单选框对应功能】----------------------------------------
fun_1:	;后缀菜单
	Gosub, suffix_fun
Return

fun_2:	;菜单项
	Gosub, menu_fun
Return

fun_3:	;百度一下
	URIContent:=URIEncode(Content)	;网页搜索时内容进行URI转义
	Run https://www.baidu.com/s?wd=%URIContent%
Return

;----------------------------------------【辅助函数位置】----------------------------------------